; ###### Techs ######

; ### Grenades and Rounds ###
[IncendiaryBlast X2TechTemplate]
DisplayName="Incendiary Blast"
Summary="With the number of \"Lost\" swarms increasing in the battlefield, it has become imperative that we develop equipment capable of disrupting them. Tygan proposed we base our designs on the fire weapons used by ADVENT Purifiers."

[ToxicDelivery X2TechTemplate]
DisplayName="Toxic Delivery"
Summary="With our new understanding of the \"Viper's\" anatomy, we should be able synthetize the deadly toxin produced in their venom sacs for use in our own weaponry. It could make our munitions especially effective against organical units."

[CorrosiveTouch X2TechTemplate]
DisplayName="Corrosive Touch"
Summary="By incorporating the corrosive substance found in the \"Andromedon's\" suit into our own weapons, we could create munitions particulary effective in destroying enemy armor, be it biological or mechanical."

; ### Rounds ###
[APRounds X2TechTemplate]
DisplayName="A.P. Rounds"
Summary="Hand machined from ultra strong, ultra light alien alloys, these deadly rounds will effectively bypass all enemy armor to deal unmitigated damage."

[TalonRounds X2TechTemplate]
DisplayName="Talon Rounds"
Summary="These rounds fracture into wicked micro-shards of alien alloy on impact, granting increased critical chance and increased bonus damage on critical hits."

[TracerRounds X2TechTemplate]
DisplayName="Tracer Rounds"
Summary="Containing high tech \"smart rounds\" that relay detailed tracking data back to the shooter when fired, this specialized ammo increases the shooter's aim when equipped."

; ### Heavy Weapons ###
[Flamethrower X2TechTemplate]
DisplayName="Flamethrower"
Summary="This wrist-mounted flamethrower relies on a super-pressurized fuel canister and a very focused nozzle to unleash a deadly cone of fire on multiple enemies."

[ShredderGun X2TechTemplate]
DisplayName="Shredder Gun"
Summary="This wrist-mounted slugthrower sprays a cone of razor-sharp particles, damaging multiple enemies and shredding their armor."

; ### Powered Weapons ###
[BlasterLauncher X2TechTemplate]
DisplayName="Blaster Launcher"
Summary="This AI-assisted high explosive shell launcher can guide its explosive projectile around obstacles to ensure maximum target impact."

[HellfireProjector X2TechTemplate]
DisplayName="Hellfire Projector"
Summary="This upgraded flamethrower deals massive damage in a small cone, damaging environment and enemy targets alike."

[PlasmaBlaster X2TechTemplate]
DisplayName="Plasma Blaster"
Summary="Using technology adapted from the aliens' own plasma weaponry, we've devised a means of releasing a massive, focused pulse of plasma energy that will devastate targets in a fixed path."

[ShredstormCannon X2TechTemplate]
DisplayName="Shredstorm Cannon"
Summary="A more aggressive variant of the Shredder Gun, the Shredstorm Cannon fires razor sharp particles in a cone to devastate close proximity targets."

; ### Vests ###
[HazmatVest X2TechTemplate]
DisplayName="Hazmat Vest"
Summary="By reinforcing the Nanoscale Vest with specialized materials, soldiers gain an additional health boost and are completely resistant to any environmental hazards like fire, acid or poison."

[Hellweave X2TechTemplate]
DisplayName="Hellweave"
Summary="Hellweave not only grants a bonus to soldier health, but will return damage to any enemy melee attackers, and grants a chance to set them afire."

[PlatedVest X2TechTemplate]
DisplayName="Plated Vest"
Summary="By outfitting the traditional Nanoscale Vest with armored plating, soldiers gain an additional health boost and additional armor protection from enemy attacks."

[StasisVest X2TechTemplate]
DisplayName="Stasis Vest"
Summary="This upgraded Nanoscale Vest grants additional health to a soldier, and its built-in Medikit IV will automatically restore health to wounded soldiers."

; ###### Vanilla Override ######
; ### Reference to the Resistance fire weapons changed for the ADVENT Purifiers fire weapons ###
[Firebomb X2GrenadeTemplate]
BriefSummary="The Incendiary Grenade is a technical improvement to the fire weapons wielded by ADVENT Purifiers. After the initial blast, most targets will be set aflame and suffer persistent burning damage."